Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/_PinMap/IfxGeth_PinMap.h
/**
 * \file IfxGeth_PinMap.h
 * \brief GETH I/O map
 * \ingroup IfxLld_Geth
 *
 * \version iLLD_1_20_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 * Use of this file is subject to the terms of use agreed between (i) you or
 * the company in which ordinary course of business you are acting and (ii)
 * Infineon Technologies AG or its licensees. If and as long as no such terms
 * of use are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxLld_Geth_pinmap GETH Pin Mapping
 * \ingroup IfxLld_Geth
 */

#ifndef IFXGETH_PINMAP_H
#define IFXGETH_PINMAP_H

#include "Ifx_Cfg.h"

#if defined(DEVICE_TC39XB) 
#if defined(IFX_PIN_PACKAGE_516)
#include "IfxGeth_PinMap_TC39xB_516.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA292)
#include "IfxGeth_PinMap_TC39xB_LFBGA292.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA292_ADAS)
#include "IfxGeth_PinMap_TC39xB_LFBGA292_adas.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA516)
#include "IfxGeth_PinMap_TC39xB_LFBGA516.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA180) || defined(IFX_PIN_PACKAGE_LFBGA180_ADAS) || defined(IFX_PIN_PACKAGE_TQFP80) || defined(IFX_PIN_PACKAGE_TQFP100) || defined(IFX_PIN_PACKAGE_TQFP144) || defined(IFX_PIN_PACKAGE_LQFP144) || defined(IFX_PIN_PACKAGE_LQFP176) || defined(IFX_PIN_PACKAGE_LFBGA292_GETH)
#error "The pin package enabled in Ifx_Cfg.h file is not supported for the selected device"
#endif

#elif defined(DEVICE_TC38X) 
#if defined(IFX_PIN_PACKAGE_516)
#include "IfxGeth_PinMap_TC38x_516.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA292)
#include "IfxGeth_PinMap_TC38x_LFBGA292.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA516)
#include "IfxGeth_PinMap_TC38x_LFBGA516.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA180) || defined(IFX_PIN_PACKAGE_LFBGA180_ADAS) || defined(IFX_PIN_PACKAGE_LFBGA292_ADAS) || defined(IFX_PIN_PACKAGE_TQFP80) || defined(IFX_PIN_PACKAGE_TQFP100) || defined(IFX_PIN_PACKAGE_TQFP144) || defined(IFX_PIN_PACKAGE_LQFP144) || defined(IFX_PIN_PACKAGE_LQFP176) || defined(IFX_PIN_PACKAGE_LFBGA292_GETH)
#error "The pin package enabled in Ifx_Cfg.h file is not supported for the selected device"
#endif

#elif defined(DEVICE_TC38EVOX) 
#if defined(IFX_PIN_PACKAGE_516)
#include "IfxGeth_PinMap_TC38EVOx_516.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA292)
#include "IfxGeth_PinMap_TC38EVOx_LFBGA292.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA180) || defined(IFX_PIN_PACKAGE_LFBGA516) || defined(IFX_PIN_PACKAGE_LFBGA180_ADAS) || defined(IFX_PIN_PACKAGE_LFBGA292_ADAS) || defined(IFX_PIN_PACKAGE_TQFP80) || defined(IFX_PIN_PACKAGE_TQFP100) || defined(IFX_PIN_PACKAGE_TQFP144) || defined(IFX_PIN_PACKAGE_LQFP144) || defined(IFX_PIN_PACKAGE_LQFP176) || defined(IFX_PIN_PACKAGE_LFBGA292_GETH)
#error "The pin package enabled in Ifx_Cfg.h file is not supported for the selected device"
#endif

#elif defined(DEVICE_TC37XED) 
#if defined(IFX_PIN_PACKAGE_516)
#include "IfxGeth_PinMap_TC37xED_516.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA292)
#include "IfxGeth_PinMap_TC37xED_LFBGA292.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA292_GETH)
#include "IfxGeth_PinMap_TC37xED_LFBGA292_geth.h"
#elif defined(IFX_PIN_PACKAGE_LQFP144)
#include "IfxGeth_PinMap_TC37xED_LQFP144.h"
#elif defined(IFX_PIN_PACKAGE_LQFP176)
#include "IfxGeth_PinMap_TC37xED_LQFP176.h"
#elif defined(IFX_PIN_PACKAGE_TQFP144)
#include "IfxGeth_PinMap_TC37xED_TQFP144.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA180) || defined(IFX_PIN_PACKAGE_LFBGA516) || defined(IFX_PIN_PACKAGE_LFBGA180_ADAS) || defined(IFX_PIN_PACKAGE_LFBGA292_ADAS) || defined(IFX_PIN_PACKAGE_TQFP80) || defined(IFX_PIN_PACKAGE_TQFP100)
#error "The pin package enabled in Ifx_Cfg.h file is not supported for the selected device"
#endif

#elif defined(DEVICE_TC37X) 
#if defined(IFX_PIN_PACKAGE_516)
#include "IfxGeth_PinMap_TC37x_516.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA292)
#include "IfxGeth_PinMap_TC37x_LFBGA292.h"
#elif defined(IFX_PIN_PACKAGE_LQFP176)
#include "IfxGeth_PinMap_TC37x_LQFP176.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA180) || defined(IFX_PIN_PACKAGE_LFBGA516) || defined(IFX_PIN_PACKAGE_LFBGA180_ADAS) || defined(IFX_PIN_PACKAGE_LFBGA292_ADAS) || defined(IFX_PIN_PACKAGE_TQFP80) || defined(IFX_PIN_PACKAGE_TQFP100) || defined(IFX_PIN_PACKAGE_TQFP144) || defined(IFX_PIN_PACKAGE_LQFP144) || defined(IFX_PIN_PACKAGE_LFBGA292_GETH)
#error "The pin package enabled in Ifx_Cfg.h file is not supported for the selected device"
#endif

#elif defined(DEVICE_TC36X) 
#if defined(IFX_PIN_PACKAGE_516)
#include "IfxGeth_PinMap_TC36x_516.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA180)
#include "IfxGeth_PinMap_TC36x_LFBGA180.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA292)
#include "IfxGeth_PinMap_TC36x_LFBGA292.h"
#elif defined(IFX_PIN_PACKAGE_LQFP144)
#include "IfxGeth_PinMap_TC36x_LQFP144.h"
#elif defined(IFX_PIN_PACKAGE_LQFP176)
#include "IfxGeth_PinMap_TC36x_LQFP176.h"
#elif defined(IFX_PIN_PACKAGE_TQFP144)
#include "IfxGeth_PinMap_TC36x_TQFP144.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA516) || defined(IFX_PIN_PACKAGE_LFBGA180_ADAS) || defined(IFX_PIN_PACKAGE_LFBGA292_ADAS) || defined(IFX_PIN_PACKAGE_TQFP80) || defined(IFX_PIN_PACKAGE_TQFP100) || defined(IFX_PIN_PACKAGE_LFBGA292_GETH)
#error "The pin package enabled in Ifx_Cfg.h file is not supported for the selected device"
#endif

#elif defined(DEVICE_TC35X) 
#if defined(IFX_PIN_PACKAGE_516)
#include "IfxGeth_PinMap_TC35x_516.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA180_ADAS)
#include "IfxGeth_PinMap_TC35x_LFBGA180_adas.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA292_ADAS)
#include "IfxGeth_PinMap_TC35x_LFBGA292_adas.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA180) || defined(IFX_PIN_PACKAGE_LFBGA516) || defined(IFX_PIN_PACKAGE_LFBGA292) || defined(IFX_PIN_PACKAGE_TQFP80) || defined(IFX_PIN_PACKAGE_TQFP100) || defined(IFX_PIN_PACKAGE_TQFP144) || defined(IFX_PIN_PACKAGE_LQFP144) || defined(IFX_PIN_PACKAGE_LQFP176) || defined(IFX_PIN_PACKAGE_LFBGA292_GETH)
#error "The pin package enabled in Ifx_Cfg.h file is not supported for the selected device"
#endif

#elif defined(DEVICE_TC33XED) 
#if defined(IFX_PIN_PACKAGE_516)
#include "IfxGeth_PinMap_TC33xED_516.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA180_ADAS)
#include "IfxGeth_PinMap_TC33xED_LFBGA180_adas.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA292_ADAS)
#include "IfxGeth_PinMap_TC33xED_LFBGA292_adas.h"
#elif defined(IFX_PIN_PACKAGE_LFBGA180) || defined(IFX_PIN_PACKAGE_LFBGA516) || defined(IFX_PIN_PACKAGE_LFBGA292) || defined(IFX_PIN_PACKAGE_TQFP80) || defined(IFX_PIN_PACKAGE_TQFP100) || defined(IFX_PIN_PACKAGE_TQFP144) || defined(IFX_PIN_PACKAGE_LQFP144) || defined(IFX_PIN_PACKAGE_LQFP176) || defined(IFX_PIN_PACKAGE_LFBGA292_GETH)
#error "The pin package enabled in Ifx_Cfg.h file is not supported for the selected device"
#endif

#endif 

#endif /* IFXGETH_PINMAP_H */
